wintersmith/contents/articles/Erlang/2015-02-19-erlang-socket-programming.html
---
date: 2015-02-19 21:05:45
template: tech.jade
title: Erlang Socket编程
category: Erlang
chage_frequency: monthly
tag: Erlang
---
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">TCP Socket</a>
<ul>
<li><a href="#sec-1-1">主动消息模式（active ＝ true）</a></li>
<li><a href="#sec-1-2">被动消息模式（active ＝ false）</a></li>
<li><a href="#sec-1-3">混合消息模式（active ＝ once）</a></li>
</ul>
</li>
<li><a href="#sec-2">UDP Socket</a></li>
</ul>
</div>
</div>

<p>
Erlang 提供了 <code>gen_tcp</code> 和 <code>gen_udp</code> 模块，方便进行网络编程。
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">TCP Socket</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">主动消息模式（active ＝ true）</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Socket接收消息非阻塞，不等上层应用fetch，就送达，接收端不可控制发送方的发送。
</p>
<div class="org-src-container">

<pre class="src src-erlang">{ok, Listen} = gen_tcp:listen(Port, [...,{active, true}]), %% active设置为true
....
receive %% 使用receive来接收Socket数据
  {tcp,Socket,Data} -&gt;
    ....
end.
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">被动消息模式（active ＝ false）</h3>
<div class="outline-text-3" id="text-1-2">
<p>
消息不会直接投递到mailbox，接收方主动receive，若不receive，发送方会进入阻塞。
</p>
<div class="org-src-container">

<pre class="src src-erlang">{ok, Listen} = gen_tcp:listen(Port, [...,{active, false}]), %% active设置为false
....
case gen_tcp:recv(Socket,N) of  %% 使用gen_tcp:recv获取数据
     {ok, B} -&gt;
       ...
end
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3">混合消息模式（active ＝ once）</h3>
<div class="outline-text-3" id="text-1-3">
<p>
开始时为主动模式，receive一个消息后，自动进入被动模式。
</p>
<div class="org-src-container">

<pre class="src src-erlang">{ok, Listen} = gen_tcp:listen(Port, [...,{active, once}]), %% active设置为once，为主动模式
....
receive %% 使用receive来接收Socket数据
  {tcp,Socket,Data} -&gt; %% 获取到数据之后，Socket进入被动模式
    ....
  inet:setopts(Socket, [{active, once}]) %% 在此处可以改变模式为主动模式，然后继续接收
end.
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">UDP Socket</h2>
</div>
